//整数数组 nums 按升序排列，数组中的值 互不相同 。 
//
// 在传递给函数之前，nums 在预先未知的某个下标 k（0 <= k < nums.length）上进行了 旋转，使数组变为 [nums[k], nums[
//k+1], ..., nums[n-1], nums[0], nums[1], ..., nums[k-1]]（下标 从 0 开始 计数）。例如， [0,1,2
//,4,5,6,7] 在下标 3 处经旋转后可能变为 [4,5,6,7,0,1,2] 。 
//
// 给你 旋转后 的数组 nums 和一个整数 target ，如果 nums 中存在这个目标值 target ，则返回它的下标，否则返回 -1 。 
//
// 
//
// 示例 1： 
//
// 
//输入：nums = [4,5,6,7,0,1,2], target = 0
//输出：4
// 
//
// 示例 2： 
//
// 
//输入：nums = [4,5,6,7,0,1,2], target = 3
//输出：-1 
//
// 示例 3： 
//
// 
//输入：nums = [1], target = 0
//输出：-1
// 
//
// 
//
// 提示： 
//
// 
// 1 <= nums.length <= 5000 
// -10^4 <= nums[i] <= 10^4 
// nums 中的每个值都 独一无二 
// 题目数据保证 nums 在预先未知的某个下标上进行了旋转 
// -10^4 <= target <= 10^4 
// 
//
// 
//
// 进阶：你可以设计一个时间复杂度为 O(log n) 的解决方案吗？ 
// Related Topics 数组 二分查找 
// 👍 1811 👎 0


class P_33_SearchInRotatedSortedArray {
    //leetcode submit region begin(Prohibit modification and deletion)
class Solution {
    fun search(nums: IntArray, target: Int): Int {
        if (nums.size == 1) return if (nums[0] == target) 0 else -1
        var p1 = 0

        var p2 = nums.size-1


        while (p1 <= p2) {
            var mid = p1 + (p2-p1) / 2

            if (target == nums[mid]) {
                return mid
            }

            /**
             *  "将数组一分为二，其中一定有一个是有序的，另一个可能是有序，也能是部分有序。
                此时有序部分用二分法查找。无序部分再一分为二，其中一个一定有序，另一个可能有序，可能无序。就这样循环."
             */
            // 1. 先确定有序数组：要么左边，要么右边，必然有一个区域有序！
            // 2. 并根据有序的那个部分确定我们该如何改变二分查找的上下界
            if (nums[p1] <= nums[mid]) {
                // 注意开闭区间的选择！可以联系下面区间的更新。
                // 比如"p2 = mid-1"，已经把位于mid的数字排除在外了。
                // 那在判断时，"target < nums[mid]"必然就不能包括边界
                if (target >= nums[p1] && target < nums[mid]) {
                    p2 = mid-1
                } else {
                    p1 = mid + 1
                }
            } else {
                if (target > nums[mid] && target <= nums[p2]) {
                    p1 = mid+1
                } else {
                    p2 = mid-1
                }
            }
        }
        return -1
    }
}
//leetcode submit region end(Prohibit modification and deletion)

}

fun main() {
    println(P_33_SearchInRotatedSortedArray.Solution().search(intArrayOf(5,1,3), 3))
//    println(P_33_SearchInRotatedSortedArray.Solution().search(intArrayOf(4,5,6,7,0,1,2), 0))
}